2.1/diagrams/consent-lifecycle.dot
digraph G {
    rankdir=LR ; compound=true ;
    node [shape=rect,style=filled,fillcolor=yellow] ;
    start,end [shape=circle,fillcolor=salmon,width=0.1,height=0.1,margin=0.01]
    start -> NoticeShown -> Requested -> Given, Refused ;
    Given -> Withdrawn, Expired, Invalidated, Halted ;
    Refused -> NoticeShown [label="new request"] ;
    subgraph cluster_T {
        label="Terminated"
        Withdrawn, Expired, Invalidated, Halted ;
    }
    Expired -> end [ltail=cluster_T] ;
    Given -> NoticeShown [label="re-confirm"] ;
}
